const UPDATE = [
  [
    'アップデート(10/22)',
    '・チャットの全体送信キーを変更',
    '・チャット受信時により気づきやすいデザインに変更'
  ],
  [
    'アップデート(8/28)',
    '・複数の権限クラスを追加',
    '・管理ページの追加',
    '　・参加者一覧/各参加者の名前・ルーム・通信速度等を確認できます'
  ],
  [
    'アップデート(8/26)',
    '・デザインの改修'
  ],
  [
    'アップデート(8/22)',
    '・ログイン機構の変更',
    '　・2回目以降は自動ログインします',
    '　・通信切断後の復帰時に自動で再ログインします',
    '・その他軽微な修正/改善'
  ],
  [
    'アップデート(6/20)',
    '・接続/切断時に右上に通知が出るように変更',
    '・右上ping(echo)の表示を一部修正',
    '　・通信されていない状態を「-1」と表示',
    '・サーバー側のいくつかの変更'
  ],
  [
    'アップデート(5/30)',
    '・入力部を複数行/改行可能にしました．',
    '・tabキーの入力候補が被らないための方式を実装しました．',
    '　上の「Type」から新方式を選択できます．',
    '・表示部とFキー部の横幅比率を変更できます．',
    '　ヘッダーに調節部があります(マウスオーバーで表示)．',
    '・接続が切れた後，接続が復帰すると自動的にRoomに入り直すようにしました．',
    '　(画面をリロードすると効きません)'
  ]
]

export default UPDATE
